Revit 2024 API
BuiltInFailures.StairRampFailures.CannotComputeRailElevation Property
 Can't compute elevation profile for one or more Rails
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotComputeRailElevation { get; }
Visual Basic
Public Shared ReadOnly Property CannotComputeRailElevation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotComputeRailElevation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace